<unk>	0
<s>	0
</s>	0
<0x00>	0
<0x01>	0
<0x02>	0
<0x03>	0
<0x04>	0
<0x05>	0
<0x06>	0
<0x07>	0
<0x08>	0
<0x09>	0
<0x0A>	0
<0x0B>	0
<0x0C>	0
<0x0D>	0
<0x0E>	0
<0x0F>	0
<0x10>	0
<0x11>	0
<0x12>	0
<0x13>	0
<0x14>	0
<0x15>	0
<0x16>	0
<0x17>	0
<0x18>	0
<0x19>	0
<0x1A>	0
<0x1B>	0
<0x1C>	0
<0x1D>	0
<0x1E>	0
<0x1F>	0
<0x20>	0
<0x21>	0
<0x22>	0
<0x23>	0
<0x24>	0
<0x25>	0
<0x26>	0
<0x27>	0
<0x28>	0
<0x29>	0
<0x2A>	0
<0x2B>	0
<0x2C>	0
<0x2D>	0
<0x2E>	0
<0x2F>	0
<0x30>	0
<0x31>	0
<0x32>	0
<0x33>	0
<0x34>	0
<0x35>	0
<0x36>	0
<0x37>	0
<0x38>	0
<0x39>	0
<0x3A>	0
<0x3B>	0
<0x3C>	0
<0x3D>	0
<0x3E>	0
<0x3F>	0
<0x40>	0
<0x41>	0
<0x42>	0
<0x43>	0
<0x44>	0
<0x45>	0
<0x46>	0
<0x47>	0
<0x48>	0
<0x49>	0
<0x4A>	0
<0x4B>	0
<0x4C>	0
<0x4D>	0
<0x4E>	0
<0x4F>	0
<0x50>	0
<0x51>	0
<0x52>	0
<0x53>	0
<0x54>	0
<0x55>	0
<0x56>	0
<0x57>	0
<0x58>	0
<0x59>	0
<0x5A>	0
<0x5B>	0
<0x5C>	0
<0x5D>	0
<0x5E>	0
<0x5F>	0
<0x60>	0
<0x61>	0
<0x62>	0
<0x63>	0
<0x64>	0
<0x65>	0
<0x66>	0
<0x67>	0
<0x68>	0
<0x69>	0
<0x6A>	0
<0x6B>	0
<0x6C>	0
<0x6D>	0
<0x6E>	0
<0x6F>	0
<0x70>	0
<0x71>	0
<0x72>	0
<0x73>	0
<0x74>	0
<0x75>	0
<0x76>	0
<0x77>	0
<0x78>	0
<0x79>	0
<0x7A>	0
<0x7B>	0
<0x7C>	0
<0x7D>	0
<0x7E>	0
<0x7F>	0
<0x80>	0
<0x81>	0
<0x82>	0
<0x83>	0
<0x84>	0
<0x85>	0
<0x86>	0
<0x87>	0
<0x88>	0
<0x89>	0
<0x8A>	0
<0x8B>	0
<0x8C>	0
<0x8D>	0
<0x8E>	0
<0x8F>	0
<0x90>	0
<0x91>	0
<0x92>	0
<0x93>	0
<0x94>	0
<0x95>	0
<0x96>	0
<0x97>	0
<0x98>	0
<0x99>	0
<0x9A>	0
<0x9B>	0
<0x9C>	0
<0x9D>	0
<0x9E>	0
<0x9F>	0
<0xA0>	0
<0xA1>	0
<0xA2>	0
<0xA3>	0
<0xA4>	0
<0xA5>	0
<0xA6>	0
<0xA7>	0
<0xA8>	0
<0xA9>	0
<0xAA>	0
<0xAB>	0
<0xAC>	0
<0xAD>	0
<0xAE>	0
<0xAF>	0
<0xB0>	0
<0xB1>	0
<0xB2>	0
<0xB3>	0
<0xB4>	0
<0xB5>	0
<0xB6>	0
<0xB7>	0
<0xB8>	0
<0xB9>	0
<0xBA>	0
<0xBB>	0
<0xBC>	0
<0xBD>	0
<0xBE>	0
<0xBF>	0
<0xC0>	0
<0xC1>	0
<0xC2>	0
<0xC3>	0
<0xC4>	0
<0xC5>	0
<0xC6>	0
<0xC7>	0
<0xC8>	0
<0xC9>	0
<0xCA>	0
<0xCB>	0
<0xCC>	0
<0xCD>	0
<0xCE>	0
<0xCF>	0
<0xD0>	0
<0xD1>	0
<0xD2>	0
<0xD3>	0
<0xD4>	0
<0xD5>	0
<0xD6>	0
<0xD7>	0
<0xD8>	0
<0xD9>	0
<0xDA>	0
<0xDB>	0
<0xDC>	0
<0xDD>	0
<0xDE>	0
<0xDF>	0
<0xE0>	0
<0xE1>	0
<0xE2>	0
<0xE3>	0
<0xE4>	0
<0xE5>	0
<0xE6>	0
<0xE7>	0
<0xE8>	0
<0xE9>	0
<0xEA>	0
<0xEB>	0
<0xEC>	0
<0xED>	0
<0xEE>	0
<0xEF>	0
<0xF0>	0
<0xF1>	0
<0xF2>	0
<0xF3>	0
<0xF4>	0
<0xF5>	0
<0xF6>	0
<0xF7>	0
<0xF8>	0
<0xF9>	0
<0xFA>	0
<0xFB>	0
<0xFC>	0
<0xFD>	0
<0xFE>	0
<0xFF>	0
‚ĖĀ	-0.519328
=	-3.10786
if	-3.93276
:	-4.13712
+	-4.2163
>	-4.70326
<	-4.70347
E	-4.75103
P	-4.75103
T	-4.75103
#	-4.75103
S	-4.75103
y	-4.88378
x	-4.88882
v	-4.89157
z	-4.89981
t	-4.90039
u	-4.90135
h	-4.90656
l	-4.9111
w	-4.91371
i	-4.91964
n	-4.92038
r	-4.92356
m	-4.92523
d	-4.92696
k	-4.92773
c	-4.93
s	-4.93028
j	-4.93505
g	-4.93524
e	-4.93678
a	-4.93761
p	-4.94152
f	-4.95717
o	-4.96536
q	-4.96652
b	-4.96834
$	-5.53251
kb	-5.67675
qd	-5.67768
we	-5.68467
mc	-5.68518
ef	-5.76141
og	-5.77644
:$	-6.13605
‚ĖĀ@^$	-6.30641
‚ĖĀ<‚ĖĀ0:	-7.93082
‚ĖĀ>‚ĖĀ0:	-7.93579
if‚ĖĀmc	-8.27845
if‚ĖĀqd	-8.2847
if‚ĖĀkb	-8.28725
if‚ĖĀwe	-8.29604
if‚ĖĀef	-8.36657
if‚ĖĀog	-8.38561
‚ĖĀ>‚ĖĀ-8:	-8.53822
‚ĖĀ<‚ĖĀ8:	-8.53866
‚ĖĀ<‚ĖĀ7:	-8.55709
‚ĖĀ<‚ĖĀ4:	-8.56176
‚ĖĀ>‚ĖĀ-7:	-8.56604
‚ĖĀ>‚ĖĀ-5:	-8.58285
‚ĖĀ>‚ĖĀ-3:	-8.58495
‚ĖĀ<‚ĖĀ3:	-8.58511
‚ĖĀ<‚ĖĀ2:	-8.59623
‚ĖĀ>‚ĖĀ-2:	-8.60623
dyk	-8.63757
‚ĖĀ>‚ĖĀ2:	-8.63945
‚ĖĀ<‚ĖĀ-2:	-8.64114
kqi	-8.64552
‚ĖĀ<‚ĖĀ-3:	-8.64976
qak	-8.65142
‚ĖĀ>‚ĖĀ3:	-8.66094
jb	-8.66241
gmb	-8.66243
qye	-8.66969
fqm	-8.67141
zij	-8.67402
‚ĖĀ<‚ĖĀ-5:	-8.67718
‚ĖĀ>‚ĖĀ4:	-8.67805
zuq	-8.67978
‚ĖĀ<‚ĖĀ-7:	-8.68332
poo	-8.68524
wry	-8.68646
‚ĖĀ>‚ĖĀ7:	-8.68765
teu	-8.68845
sqp	-8.68853
gsd	-8.68936
oiw	-8.69077
hst	-8.69328
pfw	-8.69513
mon	-8.69801
asl	-8.69937
axx	-8.69944
osi	-8.70191
gnz	-8.70277
ngf	-8.70314
‚ĖĀ>‚ĖĀ8:	-8.70423
‚ĖĀ<‚ĖĀ-8:	-8.70527
qul	-8.70688
qis	-8.70757
huy	-8.70823
gax	-8.70841
par	-8.70894
lom	-8.70952
rgj	-8.70963
gch	-8.70973
csv	-8.71049
zqg	-8.71163
ima	-8.71202
eoc	-8.71443
tau	-8.99457
lko	-8.9965
cck	-9.00174
krg	-9.01656
lpn	-9.0176
rqo	-9.02044
mop	-9.02176
kqb	-9.03037
pot	-9.03043
evq	-9.03527
ysp	-9.03579
mlo	-9.03729
qpo	-9.03817
afj	-9.03916
gmp	-9.0401
apz	-9.0407
wbr	-9.04147
vpi	-9.04178
txr	-9.04297
lvl	-9.04448
nmo	-9.04646
nrv	-9.0489
zsm	-9.05021
wzk	-9.05154
gwl	-9.052
hpc	-9.05259
iob	-9.05435
jbk	-9.05499
crm	-9.05527
zri	-9.05888
awd	-9.06056
goa	-9.06182
vtl	-9.06545
apt	-9.06569
rmm	-9.06589
ojf	-9.0668
jla	-9.06854
rug	-9.06857
jej	-9.06868
mwr	-9.06993
iks	-9.07018
jnp	-9.07032
psq	-9.0706
zjs	-9.07126
qkn	-9.07127
kqn	-9.07197
yqv	-9.07354
ggw	-9.07415
qsc	-9.07447
ggh	-9.07476
mzx	-9.07487
urz	-9.07562
yew	-9.07584
jpb	-9.07595
jpv	-9.07657
ppp	-9.07684
tce	-9.07713
fqq	-9.07727
ayr	-9.07763
xze	-9.07771
tdh	-9.07783
cvy	-9.07796
eqa	-9.07796
dti	-9.07808
fpa	-9.07841
kxk	-9.0788
xhw	-9.07927
hzr	-9.0793
ihj	-9.07976
bqy	-9.08004
xkf	-9.08006
nrc	-9.08021
utq	-9.08042
vvd	-9.08064
omn	-9.08082
frl	-9.08092
flb	-9.08132
gdu	-9.08153
mty	-9.08155
lqt	-9.08187
tfh	-9.08202
xqz	-9.08341
ono	-9.0844
jwq	-9.08457
gah	-9.08472
fjw	-9.08473
jmz	-9.08496
hna	-9.08512
kqc	-9.08517
gtg	-9.0857
bnc	-9.08639
ges	-9.08641
ipm	-9.08653
hwx	-9.08654
onm	-9.08721
dut	-9.08721
whf	-9.08729
stt	-9.0873
rwk	-9.08735
rsy	-9.08793
ltd	-9.08823
zbx	-9.08825
pfs	-9.08849
vrp	-9.08852
kql	-9.0894
hhs	-9.0894
hnb	-9.0895
uov	-9.08963
tbh	-9.08986
jxe	-9.09018
ygs	-9.09067
brd	-9.09071
hkj	-9.09084
geh	-9.09088
goi	-9.09119
mbe	-9.09124
pln	-9.0922
vsg	-9.09247
opg	-9.09267
dcr	-9.09424
qud	-9.09433
tyx	-9.09435
nnn	-9.09454
wrt	-9.09898
fae	-9.0991
krq	-9.09962
rtv	-9.10001
gfu	-9.10038
^	-12.1924
;	-12.1925
@	-12.1926
?	-12.1927
9	-12.1928
0	-12.1929
6	-12.193
4	-12.1931
5	-12.1932
1	-12.1933
8	-12.1934
7	-12.1935
3	-12.1936
2	-12.1937
-	-12.1938
