<unk>	0
<s>	0
</s>	0
<0x00>	0
<0x01>	0
<0x02>	0
<0x03>	0
<0x04>	0
<0x05>	0
<0x06>	0
<0x07>	0
<0x08>	0
<0x09>	0
<0x0A>	0
<0x0B>	0
<0x0C>	0
<0x0D>	0
<0x0E>	0
<0x0F>	0
<0x10>	0
<0x11>	0
<0x12>	0
<0x13>	0
<0x14>	0
<0x15>	0
<0x16>	0
<0x17>	0
<0x18>	0
<0x19>	0
<0x1A>	0
<0x1B>	0
<0x1C>	0
<0x1D>	0
<0x1E>	0
<0x1F>	0
<0x20>	0
<0x21>	0
<0x22>	0
<0x23>	0
<0x24>	0
<0x25>	0
<0x26>	0
<0x27>	0
<0x28>	0
<0x29>	0
<0x2A>	0
<0x2B>	0
<0x2C>	0
<0x2D>	0
<0x2E>	0
<0x2F>	0
<0x30>	0
<0x31>	0
<0x32>	0
<0x33>	0
<0x34>	0
<0x35>	0
<0x36>	0
<0x37>	0
<0x38>	0
<0x39>	0
<0x3A>	0
<0x3B>	0
<0x3C>	0
<0x3D>	0
<0x3E>	0
<0x3F>	0
<0x40>	0
<0x41>	0
<0x42>	0
<0x43>	0
<0x44>	0
<0x45>	0
<0x46>	0
<0x47>	0
<0x48>	0
<0x49>	0
<0x4A>	0
<0x4B>	0
<0x4C>	0
<0x4D>	0
<0x4E>	0
<0x4F>	0
<0x50>	0
<0x51>	0
<0x52>	0
<0x53>	0
<0x54>	0
<0x55>	0
<0x56>	0
<0x57>	0
<0x58>	0
<0x59>	0
<0x5A>	0
<0x5B>	0
<0x5C>	0
<0x5D>	0
<0x5E>	0
<0x5F>	0
<0x60>	0
<0x61>	0
<0x62>	0
<0x63>	0
<0x64>	0
<0x65>	0
<0x66>	0
<0x67>	0
<0x68>	0
<0x69>	0
<0x6A>	0
<0x6B>	0
<0x6C>	0
<0x6D>	0
<0x6E>	0
<0x6F>	0
<0x70>	0
<0x71>	0
<0x72>	0
<0x73>	0
<0x74>	0
<0x75>	0
<0x76>	0
<0x77>	0
<0x78>	0
<0x79>	0
<0x7A>	0
<0x7B>	0
<0x7C>	0
<0x7D>	0
<0x7E>	0
<0x7F>	0
<0x80>	0
<0x81>	0
<0x82>	0
<0x83>	0
<0x84>	0
<0x85>	0
<0x86>	0
<0x87>	0
<0x88>	0
<0x89>	0
<0x8A>	0
<0x8B>	0
<0x8C>	0
<0x8D>	0
<0x8E>	0
<0x8F>	0
<0x90>	0
<0x91>	0
<0x92>	0
<0x93>	0
<0x94>	0
<0x95>	0
<0x96>	0
<0x97>	0
<0x98>	0
<0x99>	0
<0x9A>	0
<0x9B>	0
<0x9C>	0
<0x9D>	0
<0x9E>	0
<0x9F>	0
<0xA0>	0
<0xA1>	0
<0xA2>	0
<0xA3>	0
<0xA4>	0
<0xA5>	0
<0xA6>	0
<0xA7>	0
<0xA8>	0
<0xA9>	0
<0xAA>	0
<0xAB>	0
<0xAC>	0
<0xAD>	0
<0xAE>	0
<0xAF>	0
<0xB0>	0
<0xB1>	0
<0xB2>	0
<0xB3>	0
<0xB4>	0
<0xB5>	0
<0xB6>	0
<0xB7>	0
<0xB8>	0
<0xB9>	0
<0xBA>	0
<0xBB>	0
<0xBC>	0
<0xBD>	0
<0xBE>	0
<0xBF>	0
<0xC0>	0
<0xC1>	0
<0xC2>	0
<0xC3>	0
<0xC4>	0
<0xC5>	0
<0xC6>	0
<0xC7>	0
<0xC8>	0
<0xC9>	0
<0xCA>	0
<0xCB>	0
<0xCC>	0
<0xCD>	0
<0xCE>	0
<0xCF>	0
<0xD0>	0
<0xD1>	0
<0xD2>	0
<0xD3>	0
<0xD4>	0
<0xD5>	0
<0xD6>	0
<0xD7>	0
<0xD8>	0
<0xD9>	0
<0xDA>	0
<0xDB>	0
<0xDC>	0
<0xDD>	0
<0xDE>	0
<0xDF>	0
<0xE0>	0
<0xE1>	0
<0xE2>	0
<0xE3>	0
<0xE4>	0
<0xE5>	0
<0xE6>	0
<0xE7>	0
<0xE8>	0
<0xE9>	0
<0xEA>	0
<0xEB>	0
<0xEC>	0
<0xED>	0
<0xEE>	0
<0xEF>	0
<0xF0>	0
<0xF1>	0
<0xF2>	0
<0xF3>	0
<0xF4>	0
<0xF5>	0
<0xF6>	0
<0xF7>	0
<0xF8>	0
<0xF9>	0
<0xFA>	0
<0xFB>	0
<0xFC>	0
<0xFD>	0
<0xFE>	0
<0xFF>	0
▁	-0.614428
=	-3.33107
e	-3.64846
▁rang	-4.0806
▁in	-4.08068
+	-4.45545
y	-4.74468
w	-4.74976
v	-4.75116
#	-4.75507
E	-4.75507
P	-4.75507
T	-4.75507
S	-4.75507
z	-4.76016
t	-4.76036
x	-4.76254
if	-4.76538
h	-4.76723
j	-4.77005
u	-4.77063
n	-4.77888
l	-4.78104
d	-4.78449
m	-4.78543
c	-4.78589
r	-4.78652
a	-4.79397
k	-4.79503
g	-4.79508
i	-4.79547
s	-4.79861
f	-4.799
b	-4.79972
p	-4.80066
o	-4.81078
q	-4.82124
:	-5.12657
(3):	-5.16931
$	-5.37754
(2):	-5.38824
(1):	-5.66715
<	-5.70252
>	-5.70566
kb	-5.90361
qd	-5.93569
mc	-5.95325
we	-6.00865
og	-6.03734
ef	-6.08387
(3):$	-6.55832
(2):$	-6.8494
:$	-7.22578
(1):$	-7.26046
for	-7.42509
for▁qd	-7.74053
for▁kb	-7.7412
for▁y	-7.74821
for▁w	-7.75023
for▁d	-7.75253
for▁mc	-7.75449
for▁v	-7.76649
for▁we	-7.7718
for▁t	-7.77386
for▁f	-7.78183
for▁z	-7.78535
for▁x	-7.78565
for▁r	-7.78921
for▁n	-7.7901
for▁c	-7.79027
for▁ef	-7.79082
for▁b	-7.79811
for▁m	-7.79855
for▁j	-7.80101
for▁g	-7.80963
for▁k	-7.81184
for▁h	-7.81342
for▁o	-7.81872
for▁p	-7.81878
for▁q	-7.82158
for▁s	-7.8304
for▁u	-7.83098
for▁a	-7.84213
for▁og	-7.84742
for▁l	-7.85196
for▁i	-7.85924
qak	-8.70832
kqi	-8.7115
gmb	-8.72803
dyk	-8.72825
zij	-8.73067
fqm	-8.73243
poo	-8.73592
mon	-8.73723
gsd	-8.75152
sqp	-8.75313
gax	-8.7532
zuq	-8.75327
qye	-8.75412
axx	-8.75875
pfw	-8.76112
ima	-8.76202
hst	-8.76248
huy	-8.7635
osi	-8.76416
csv	-8.76451
oiw	-8.76471
qul	-8.76681
zqg	-8.76791
ngf	-8.7689
teu	-8.76959
par	-8.77033
qis	-8.77232
rgj	-8.77613
lom	-8.77772
asl	-8.77912
eoc	-8.77935
gnz	-8.78202
gch	-8.78211
wry	-8.78283
▁>▁0:	-8.8463
▁<▁0:	-8.85605
tau	-9.00815
cck	-9.01011
lpn	-9.01236
lko	-9.02381
ysp	-9.03994
rqo	-9.04614
gwl	-9.04624
krg	-9.04761
pot	-9.04763
apz	-9.04892
lvl	-9.05003
kqb	-9.05283
hpc	-9.05659
zsm	-9.05748
mop	-9.05758
afj	-9.05827
nrv	-9.06068
nmo	-9.06075
qpo	-9.06361
jbk	-9.06437
wzk	-9.06571
gmp	-9.06619
vpi	-9.06778
txr	-9.06863
crm	-9.07019
iks	-9.0708
fpa	-9.07515
utq	-9.07521
wbr	-9.07579
evq	-9.07719
mlo	-9.07811
omn	-9.07888
iob	-9.07991
gbu	-9.08012
ojf	-9.08109
apt	-9.08135
hna	-9.08155
tyx	-9.08156
jwq	-9.0841
zri	-9.08502
jnp	-9.08547
pfs	-9.08572
jpb	-9.086
fqq	-9.08601
kqc	-9.08614
xqz	-9.08688
mwr	-9.08794
qsc	-9.08913
lqt	-9.09011
gah	-9.09013
jxe	-9.09016
cvy	-9.09044
frl	-9.09054
qud	-9.09059
rmm	-9.09076
urz	-9.09229
kqn	-9.09294
mzx	-9.09303
dut	-9.09357
pln	-9.09376
xkf	-9.09377
vtl	-9.09467
zbx	-9.09483
awd	-9.09486
yqv	-9.09511
onm	-9.09554
goa	-9.09576
fjw	-9.09587
gtg	-9.09606
qkn	-9.09675
ppp	-9.09682
ono	-9.09698
dcr	-9.09717
hkj	-9.09717
eqa	-9.09729
nnn	-9.09771
zjs	-9.09858
gfu	-9.09861
jla	-9.09874
hnb	-9.09925
stt	-9.09931
hzr	-9.09955
hhs	-9.09957
kql	-9.09999
ggh	-9.10007
vrp	-9.1003
rtv	-9.10064
bqy	-9.10071
brd	-9.1011
yew	-9.10115
rug	-9.1018
ihj	-9.10239
bnc	-9.10247
fae	-9.10252
tcu	-9.10257
tdh	-9.10266
mbe	-9.1029
ltd	-9.10322
jej	-9.10346
ggw	-9.10367
sui	-9.10371
vsg	-9.10388
psq	-9.10406
goi	-9.10471
ygs	-9.10498
ayr	-9.10513
whf	-9.10575
qjj	-9.10594
kxk	-9.10612
vvd	-9.10731
gdu	-9.10758
uov	-9.1081
xhw	-9.10829
tfh	-9.10989
^	-12.0428
@	-12.0429
9	-12.043
6	-12.0431
5	-12.0432
4	-12.0433
8	-12.0434
7	-12.0435
)	-12.0436
(	-12.0437
0	-12.0438
3	-12.0439
1	-12.044
;	-12.0441
2	-12.0442
?	-12.0443
-	-12.0444
