{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "!": 0,
      "\"": 1,
      "#": 2,
      "$": 3,
      "%": 4,
      "&": 5,
      "'": 6,
      "(": 7,
      ")": 8,
      "*": 9,
      "+": 10,
      ",": 11,
      "-": 12,
      ".": 13,
      "/": 14,
      "0": 15,
      "1": 16,
      "2": 17,
      "3": 18,
      "4": 19,
      "5": 20,
      "6": 21,
      "7": 22,
      "8": 23,
      "9": 24,
      ":": 25,
      ";": 26,
      "<": 27,
      "=": 28,
      ">": 29,
      "?": 30,
      "@": 31,
      "A": 32,
      "B": 33,
      "C": 34,
      "D": 35,
      "E": 36,
      "F": 37,
      "G": 38,
      "H": 39,
      "I": 40,
      "J": 41,
      "K": 42,
      "L": 43,
      "M": 44,
      "N": 45,
      "O": 46,
      "P": 47,
      "Q": 48,
      "R": 49,
      "S": 50,
      "T": 51,
      "U": 52,
      "V": 53,
      "W": 54,
      "X": 55,
      "Y": 56,
      "Z": 57,
      "[": 58,
      "\\": 59,
      "]": 60,
      "^": 61,
      "_": 62,
      "`": 63,
      "a": 64,
      "b": 65,
      "c": 66,
      "d": 67,
      "e": 68,
      "f": 69,
      "g": 70,
      "h": 71,
      "i": 72,
      "j": 73,
      "k": 74,
      "l": 75,
      "m": 76,
      "n": 77,
      "o": 78,
      "p": 79,
      "q": 80,
      "r": 81,
      "s": 82,
      "t": 83,
      "u": 84,
      "v": 85,
      "w": 86,
      "x": 87,
      "y": 88,
      "z": 89,
      "{": 90,
      "|": 91,
      "}": 92,
      "~": 93,
      "¡": 94,
      "¢": 95,
      "£": 96,
      "¤": 97,
      "¥": 98,
      "¦": 99,
      "§": 100,
      "¨": 101,
      "©": 102,
      "ª": 103,
      "«": 104,
      "¬": 105,
      "®": 106,
      "¯": 107,
      "°": 108,
      "±": 109,
      "²": 110,
      "³": 111,
      "´": 112,
      "µ": 113,
      "¶": 114,
      "·": 115,
      "¸": 116,
      "¹": 117,
      "º": 118,
      "»": 119,
      "¼": 120,
      "½": 121,
      "¾": 122,
      "¿": 123,
      "À": 124,
      "Á": 125,
      "Â": 126,
      "Ã": 127,
      "Ä": 128,
      "Å": 129,
      "Æ": 130,
      "Ç": 131,
      "È": 132,
      "É": 133,
      "Ê": 134,
      "Ë": 135,
      "Ì": 136,
      "Í": 137,
      "Î": 138,
      "Ï": 139,
      "Ð": 140,
      "Ñ": 141,
      "Ò": 142,
      "Ó": 143,
      "Ô": 144,
      "Õ": 145,
      "Ö": 146,
      "×": 147,
      "Ø": 148,
      "Ù": 149,
      "Ú": 150,
      "Û": 151,
      "Ü": 152,
      "Ý": 153,
      "Þ": 154,
      "ß": 155,
      "à": 156,
      "á": 157,
      "â": 158,
      "ã": 159,
      "ä": 160,
      "å": 161,
      "æ": 162,
      "ç": 163,
      "è": 164,
      "é": 165,
      "ê": 166,
      "ë": 167,
      "ì": 168,
      "í": 169,
      "î": 170,
      "ï": 171,
      "ð": 172,
      "ñ": 173,
      "ò": 174,
      "ó": 175,
      "ô": 176,
      "õ": 177,
      "ö": 178,
      "÷": 179,
      "ø": 180,
      "ù": 181,
      "ú": 182,
      "û": 183,
      "ü": 184,
      "ý": 185,
      "þ": 186,
      "ÿ": 187,
      "Ā": 188,
      "ā": 189,
      "Ă": 190,
      "ă": 191,
      "Ą": 192,
      "ą": 193,
      "Ć": 194,
      "ć": 195,
      "Ĉ": 196,
      "ĉ": 197,
      "Ċ": 198,
      "ċ": 199,
      "Č": 200,
      "č": 201,
      "Ď": 202,
      "ď": 203,
      "Đ": 204,
      "đ": 205,
      "Ē": 206,
      "ē": 207,
      "Ĕ": 208,
      "ĕ": 209,
      "Ė": 210,
      "ė": 211,
      "Ę": 212,
      "ę": 213,
      "Ě": 214,
      "ě": 215,
      "Ĝ": 216,
      "ĝ": 217,
      "Ğ": 218,
      "ğ": 219,
      "Ġ": 220,
      "ġ": 221,
      "Ģ": 222,
      "ģ": 223,
      "Ĥ": 224,
      "ĥ": 225,
      "Ħ": 226,
      "ħ": 227,
      "Ĩ": 228,
      "ĩ": 229,
      "Ī": 230,
      "ī": 231,
      "Ĭ": 232,
      "ĭ": 233,
      "Į": 234,
      "į": 235,
      "İ": 236,
      "ı": 237,
      "Ĳ": 238,
      "ĳ": 239,
      "Ĵ": 240,
      "ĵ": 241,
      "Ķ": 242,
      "ķ": 243,
      "ĸ": 244,
      "Ĺ": 245,
      "ĺ": 246,
      "Ļ": 247,
      "ļ": 248,
      "Ľ": 249,
      "ľ": 250,
      "Ŀ": 251,
      "ŀ": 252,
      "Ł": 253,
      "ł": 254,
      "Ń": 255,
      "Ġ-": 256,
      "Ġ=": 257,
      "Ġr": 258,
      "Ġi": 259,
      "ge": 260,
      "fo": 261,
      "an": 262,
      "Ġin": 263,
      "for": 264,
      "Ġran": 265,
      "):": 266,
      "Ġrange": 267,
      "Ġ+": 268,
      "if": 269,
      "?-": 270,
      "EP": 271,
      "ST": 272,
      "STEP": 273,
      "Ġ>": 274,
      "Ġ<": 275,
      "Ġ8": 276,
      "Ġ4": 277,
      "qd": 278,
      "kb": 279,
      "Ġ7": 280,
      "we": 281,
      "mc": 282,
      "):$": 283,
      "Ġ2": 284,
      "ef": 285,
      "og": 286,
      "Ġ0": 287,
      "Ġ3": 288,
      "Ġ6": 289,
      "Ġg": 290,
      "Ġ9": 291,
      "Ġ1": 292,
      "Ġq": 293,
      "Ġt": 294,
      "Ġh": 295,
      "Ġ5": 296,
      "Ġj": 297,
      "Ġp": 298,
      "Ġz": 299,
      "Ġk": 300,
      "Ġm": 301,
      "Ġd": 302,
      "Ġo": 303,
      "Ġf": 304,
      "Ġv": 305,
      "Ġw": 306,
      "Ġa": 307,
      "Ġy": 308,
      "Ġc": 309,
      "Ġn": 310,
      "Ġl": 311,
      "Ġe": 312,
      "Ġx": 313,
      "Ġqd": 314,
      "Ġkb": 315,
      "Ġwe": 316,
      "Ġmc": 317,
      "Ġb": 318,
      "Ġs": 319,
      "Ġef": 320,
      "Ġu": 321,
      "Ġog": 322,
      "10": 323,
      ":$": 324,
      "13": 325,
      "16": 326,
      "15": 327,
      "12": 328,
      "72": 329,
      "42": 330,
      "19": 331,
      "75": 332,
      "@^": 333,
      "@^$": 334,
      "53": 335,
      "94": 336,
      "34": 337,
      "78": 338,
      "11": 339,
      "88": 340,
      "14": 341,
      "60": 342,
      "kq": 343,
      "23": 344,
      "55": 345,
      "83": 346,
      "62": 347,
      "50": 348,
      "40": 349,
      "96": 350,
      "17": 351,
      "85": 352,
      "22": 353,
      "84": 354,
      "46": 355,
      "93": 356,
      "56": 357,
      "mo": 358,
      "95": 359,
      "71": 360,
      "wr": 361,
      "po": 362,
      "76": 363,
      "91": 364,
      "32": 365,
      "30": 366,
      "87": 367,
      "ax": 368,
      "24": 369,
      "39": 370,
      "37": 371,
      "65": 372,
      "st": 373,
      "52": 374,
      "mb": 375,
      "81": 376,
      "gf": 377,
      "ye": 378,
      "gs": 379,
      "lo": 380,
      "70": 381,
      "td": 382,
      "br": 383,
      "oi": 384,
      "90": 385,
      "zr": 386,
      "92": 387,
      "58": 388,
      "ut": 389,
      "cr": 390,
      "41": 391,
      "qa": 392,
      "pa": 393,
      "hw": 394,
      "jw": 395,
      "xk": 396,
      "sq": 397,
      "rg": 398,
      "ty": 399,
      "pp": 400,
      "nn": 401,
      "gw": 402,
      "is": 403,
      "yk": 404,
      "mz": 405,
      "qu": 406,
      "pf": 407,
      "hn": 408,
      "80": 409,
      "on": 410,
      "86": 411,
      "si": 412,
      "sl": 413,
      "20": 414,
      "qm": 415,
      "rq": 416,
      "uy": 417,
      "ma": 418,
      "sv": 419,
      "ij": 420,
      "tc": 421,
      "31": 422,
      "21": 423,
      "jp": 424,
      "zk": 425,
      "eu": 426,
      "oc": 427,
      "xr": 428,
      "kn": 429,
      "yr": 430,
      "hf": 431,
      "qg": 432,
      "nr": 433,
      "au": 434,
      "vd": 435,
      "jf": 436,
      "lb": 437,
      "mp": 438,
      "mn": 439,
      "ln": 440,
      "ck": 441,
      "ch": 442,
      "44": 443,
      "qv": 444,
      "57": 445,
      "pi": 446,
      "ti": 447,
      "67": 448,
      "uq": 449,
      "tl": 450,
      "wd": 451,
      "sc": 452,
      "ze": 453,
      "pc": 454,
      "ug": 455,
      "hj": 456,
      "bx": 457,
      "nz": 458,
      "sg": 459,
      "vy": 460,
      "vl": 461,
      "sy": 462,
      "ae": 463,
      "pg": 464,
      "qq": 465,
      "ui": 466,
      "jj": 467,
      "pz": 468,
      "mm": 469,
      "tg": 470,
      "54": 471,
      "fj": 472,
      "oz": 473,
      "rl": 474,
      "bu": 475,
      "wk": 476,
      "qz": 477,
      "qy": 478,
      "hs": 479,
      "bk": 480,
      "ej": 481,
      "Ġ10": 482,
      "tv": 483,
      "26": 484,
      "pt": 485,
      "ov": 486,
      "sp": 487,
      "kj": 488,
      "xe": 489,
      "du": 490,
      "vq": 491,
      "35": 492,
      "bh": 493,
      "Ġkq": 494,
      "97": 495,
      "pm": 496,
      "sm": 497,
      "oa": 498,
      "rz": 499,
      "jn": 500,
      "pn": 501,
      "tf": 502,
      "gh": 503,
      "la": 504,
      "ob": 505,
      "qt": 506,
      "nc": 507,
      "Ġ70": 508,
      "ah": 509,
      "Ġ80": 510,
      "js": 511
    },
    "merges": [
      [
        "Ġ",
        "-"
      ],
      [
        "Ġ",
        "="
      ],
      [
        "Ġ",
        "r"
      ],
      [
        "Ġ",
        "i"
      ],
      [
        "g",
        "e"
      ],
      [
        "f",
        "o"
      ],
      [
        "a",
        "n"
      ],
      [
        "Ġi",
        "n"
      ],
      [
        "fo",
        "r"
      ],
      [
        "Ġr",
        "an"
      ],
      [
        ")",
        ":"
      ],
      [
        "Ġran",
        "ge"
      ],
      [
        "Ġ",
        "+"
      ],
      [
        "i",
        "f"
      ],
      [
        "?",
        "-"
      ],
      [
        "E",
        "P"
      ],
      [
        "S",
        "T"
      ],
      [
        "ST",
        "EP"
      ],
      [
        "Ġ",
        ">"
      ],
      [
        "Ġ",
        "<"
      ],
      [
        "Ġ",
        "8"
      ],
      [
        "Ġ",
        "4"
      ],
      [
        "q",
        "d"
      ],
      [
        "k",
        "b"
      ],
      [
        "Ġ",
        "7"
      ],
      [
        "w",
        "e"
      ],
      [
        "m",
        "c"
      ],
      [
        "):",
        "$"
      ],
      [
        "Ġ",
        "2"
      ],
      [
        "e",
        "f"
      ],
      [
        "o",
        "g"
      ],
      [
        "Ġ",
        "0"
      ],
      [
        "Ġ",
        "3"
      ],
      [
        "Ġ",
        "6"
      ],
      [
        "Ġ",
        "g"
      ],
      [
        "Ġ",
        "9"
      ],
      [
        "Ġ",
        "1"
      ],
      [
        "Ġ",
        "q"
      ],
      [
        "Ġ",
        "t"
      ],
      [
        "Ġ",
        "h"
      ],
      [
        "Ġ",
        "5"
      ],
      [
        "Ġ",
        "j"
      ],
      [
        "Ġ",
        "p"
      ],
      [
        "Ġ",
        "z"
      ],
      [
        "Ġ",
        "k"
      ],
      [
        "Ġ",
        "m"
      ],
      [
        "Ġ",
        "d"
      ],
      [
        "Ġ",
        "o"
      ],
      [
        "Ġ",
        "f"
      ],
      [
        "Ġ",
        "v"
      ],
      [
        "Ġ",
        "w"
      ],
      [
        "Ġ",
        "a"
      ],
      [
        "Ġ",
        "y"
      ],
      [
        "Ġ",
        "c"
      ],
      [
        "Ġ",
        "n"
      ],
      [
        "Ġ",
        "l"
      ],
      [
        "Ġ",
        "e"
      ],
      [
        "Ġ",
        "x"
      ],
      [
        "Ġ",
        "qd"
      ],
      [
        "Ġ",
        "kb"
      ],
      [
        "Ġ",
        "we"
      ],
      [
        "Ġ",
        "mc"
      ],
      [
        "Ġ",
        "b"
      ],
      [
        "Ġ",
        "s"
      ],
      [
        "Ġ",
        "ef"
      ],
      [
        "Ġ",
        "u"
      ],
      [
        "Ġ",
        "og"
      ],
      [
        "1",
        "0"
      ],
      [
        ":",
        "$"
      ],
      [
        "1",
        "3"
      ],
      [
        "1",
        "6"
      ],
      [
        "1",
        "5"
      ],
      [
        "1",
        "2"
      ],
      [
        "7",
        "2"
      ],
      [
        "4",
        "2"
      ],
      [
        "1",
        "9"
      ],
      [
        "7",
        "5"
      ],
      [
        "@",
        "^"
      ],
      [
        "@^",
        "$"
      ],
      [
        "5",
        "3"
      ],
      [
        "9",
        "4"
      ],
      [
        "3",
        "4"
      ],
      [
        "7",
        "8"
      ],
      [
        "1",
        "1"
      ],
      [
        "8",
        "8"
      ],
      [
        "1",
        "4"
      ],
      [
        "6",
        "0"
      ],
      [
        "k",
        "q"
      ],
      [
        "2",
        "3"
      ],
      [
        "5",
        "5"
      ],
      [
        "8",
        "3"
      ],
      [
        "6",
        "2"
      ],
      [
        "5",
        "0"
      ],
      [
        "4",
        "0"
      ],
      [
        "9",
        "6"
      ],
      [
        "1",
        "7"
      ],
      [
        "8",
        "5"
      ],
      [
        "2",
        "2"
      ],
      [
        "8",
        "4"
      ],
      [
        "4",
        "6"
      ],
      [
        "9",
        "3"
      ],
      [
        "5",
        "6"
      ],
      [
        "m",
        "o"
      ],
      [
        "9",
        "5"
      ],
      [
        "7",
        "1"
      ],
      [
        "w",
        "r"
      ],
      [
        "p",
        "o"
      ],
      [
        "7",
        "6"
      ],
      [
        "9",
        "1"
      ],
      [
        "3",
        "2"
      ],
      [
        "3",
        "0"
      ],
      [
        "8",
        "7"
      ],
      [
        "a",
        "x"
      ],
      [
        "2",
        "4"
      ],
      [
        "3",
        "9"
      ],
      [
        "3",
        "7"
      ],
      [
        "6",
        "5"
      ],
      [
        "s",
        "t"
      ],
      [
        "5",
        "2"
      ],
      [
        "m",
        "b"
      ],
      [
        "8",
        "1"
      ],
      [
        "g",
        "f"
      ],
      [
        "y",
        "e"
      ],
      [
        "g",
        "s"
      ],
      [
        "l",
        "o"
      ],
      [
        "7",
        "0"
      ],
      [
        "t",
        "d"
      ],
      [
        "b",
        "r"
      ],
      [
        "o",
        "i"
      ],
      [
        "9",
        "0"
      ],
      [
        "z",
        "r"
      ],
      [
        "9",
        "2"
      ],
      [
        "5",
        "8"
      ],
      [
        "u",
        "t"
      ],
      [
        "c",
        "r"
      ],
      [
        "4",
        "1"
      ],
      [
        "q",
        "a"
      ],
      [
        "p",
        "a"
      ],
      [
        "h",
        "w"
      ],
      [
        "j",
        "w"
      ],
      [
        "x",
        "k"
      ],
      [
        "s",
        "q"
      ],
      [
        "r",
        "g"
      ],
      [
        "t",
        "y"
      ],
      [
        "p",
        "p"
      ],
      [
        "n",
        "n"
      ],
      [
        "g",
        "w"
      ],
      [
        "i",
        "s"
      ],
      [
        "y",
        "k"
      ],
      [
        "m",
        "z"
      ],
      [
        "q",
        "u"
      ],
      [
        "p",
        "f"
      ],
      [
        "h",
        "n"
      ],
      [
        "8",
        "0"
      ],
      [
        "o",
        "n"
      ],
      [
        "8",
        "6"
      ],
      [
        "s",
        "i"
      ],
      [
        "s",
        "l"
      ],
      [
        "2",
        "0"
      ],
      [
        "q",
        "m"
      ],
      [
        "r",
        "q"
      ],
      [
        "u",
        "y"
      ],
      [
        "m",
        "a"
      ],
      [
        "s",
        "v"
      ],
      [
        "i",
        "j"
      ],
      [
        "t",
        "c"
      ],
      [
        "3",
        "1"
      ],
      [
        "2",
        "1"
      ],
      [
        "j",
        "p"
      ],
      [
        "z",
        "k"
      ],
      [
        "e",
        "u"
      ],
      [
        "o",
        "c"
      ],
      [
        "x",
        "r"
      ],
      [
        "k",
        "n"
      ],
      [
        "y",
        "r"
      ],
      [
        "h",
        "f"
      ],
      [
        "q",
        "g"
      ],
      [
        "n",
        "r"
      ],
      [
        "a",
        "u"
      ],
      [
        "v",
        "d"
      ],
      [
        "j",
        "f"
      ],
      [
        "l",
        "b"
      ],
      [
        "m",
        "p"
      ],
      [
        "m",
        "n"
      ],
      [
        "l",
        "n"
      ],
      [
        "c",
        "k"
      ],
      [
        "c",
        "h"
      ],
      [
        "4",
        "4"
      ],
      [
        "q",
        "v"
      ],
      [
        "5",
        "7"
      ],
      [
        "p",
        "i"
      ],
      [
        "t",
        "i"
      ],
      [
        "6",
        "7"
      ],
      [
        "u",
        "q"
      ],
      [
        "t",
        "l"
      ],
      [
        "w",
        "d"
      ],
      [
        "s",
        "c"
      ],
      [
        "z",
        "e"
      ],
      [
        "p",
        "c"
      ],
      [
        "u",
        "g"
      ],
      [
        "h",
        "j"
      ],
      [
        "b",
        "x"
      ],
      [
        "n",
        "z"
      ],
      [
        "s",
        "g"
      ],
      [
        "v",
        "y"
      ],
      [
        "v",
        "l"
      ],
      [
        "s",
        "y"
      ],
      [
        "a",
        "e"
      ],
      [
        "p",
        "g"
      ],
      [
        "q",
        "q"
      ],
      [
        "u",
        "i"
      ],
      [
        "j",
        "j"
      ],
      [
        "p",
        "z"
      ],
      [
        "m",
        "m"
      ],
      [
        "t",
        "g"
      ],
      [
        "5",
        "4"
      ],
      [
        "f",
        "j"
      ],
      [
        "o",
        "z"
      ],
      [
        "r",
        "l"
      ],
      [
        "b",
        "u"
      ],
      [
        "w",
        "k"
      ],
      [
        "q",
        "z"
      ],
      [
        "q",
        "y"
      ],
      [
        "h",
        "s"
      ],
      [
        "b",
        "k"
      ],
      [
        "e",
        "j"
      ],
      [
        "Ġ1",
        "0"
      ],
      [
        "t",
        "v"
      ],
      [
        "2",
        "6"
      ],
      [
        "p",
        "t"
      ],
      [
        "o",
        "v"
      ],
      [
        "s",
        "p"
      ],
      [
        "k",
        "j"
      ],
      [
        "x",
        "e"
      ],
      [
        "d",
        "u"
      ],
      [
        "v",
        "q"
      ],
      [
        "3",
        "5"
      ],
      [
        "b",
        "h"
      ],
      [
        "Ġk",
        "q"
      ],
      [
        "9",
        "7"
      ],
      [
        "p",
        "m"
      ],
      [
        "s",
        "m"
      ],
      [
        "o",
        "a"
      ],
      [
        "r",
        "z"
      ],
      [
        "j",
        "n"
      ],
      [
        "p",
        "n"
      ],
      [
        "t",
        "f"
      ],
      [
        "g",
        "h"
      ],
      [
        "l",
        "a"
      ],
      [
        "o",
        "b"
      ],
      [
        "q",
        "t"
      ],
      [
        "n",
        "c"
      ],
      [
        "Ġ7",
        "0"
      ],
      [
        "a",
        "h"
      ],
      [
        "Ġ8",
        "0"
      ],
      [
        "j",
        "s"
      ]
    ]
  }
}