{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "!": 0,
      "\"": 1,
      "#": 2,
      "$": 3,
      "%": 4,
      "&": 5,
      "'": 6,
      "(": 7,
      ")": 8,
      "*": 9,
      "+": 10,
      ",": 11,
      "-": 12,
      ".": 13,
      "/": 14,
      "0": 15,
      "1": 16,
      "2": 17,
      "3": 18,
      "4": 19,
      "5": 20,
      "6": 21,
      "7": 22,
      "8": 23,
      "9": 24,
      ":": 25,
      ";": 26,
      "<": 27,
      "=": 28,
      ">": 29,
      "?": 30,
      "@": 31,
      "A": 32,
      "B": 33,
      "C": 34,
      "D": 35,
      "E": 36,
      "F": 37,
      "G": 38,
      "H": 39,
      "I": 40,
      "J": 41,
      "K": 42,
      "L": 43,
      "M": 44,
      "N": 45,
      "O": 46,
      "P": 47,
      "Q": 48,
      "R": 49,
      "S": 50,
      "T": 51,
      "U": 52,
      "V": 53,
      "W": 54,
      "X": 55,
      "Y": 56,
      "Z": 57,
      "[": 58,
      "\\": 59,
      "]": 60,
      "^": 61,
      "_": 62,
      "`": 63,
      "a": 64,
      "b": 65,
      "c": 66,
      "d": 67,
      "e": 68,
      "f": 69,
      "g": 70,
      "h": 71,
      "i": 72,
      "j": 73,
      "k": 74,
      "l": 75,
      "m": 76,
      "n": 77,
      "o": 78,
      "p": 79,
      "q": 80,
      "r": 81,
      "s": 82,
      "t": 83,
      "u": 84,
      "v": 85,
      "w": 86,
      "x": 87,
      "y": 88,
      "z": 89,
      "{": 90,
      "|": 91,
      "}": 92,
      "~": 93,
      "¡": 94,
      "¢": 95,
      "£": 96,
      "¤": 97,
      "¥": 98,
      "¦": 99,
      "§": 100,
      "¨": 101,
      "©": 102,
      "ª": 103,
      "«": 104,
      "¬": 105,
      "®": 106,
      "¯": 107,
      "°": 108,
      "±": 109,
      "²": 110,
      "³": 111,
      "´": 112,
      "µ": 113,
      "¶": 114,
      "·": 115,
      "¸": 116,
      "¹": 117,
      "º": 118,
      "»": 119,
      "¼": 120,
      "½": 121,
      "¾": 122,
      "¿": 123,
      "À": 124,
      "Á": 125,
      "Â": 126,
      "Ã": 127,
      "Ä": 128,
      "Å": 129,
      "Æ": 130,
      "Ç": 131,
      "È": 132,
      "É": 133,
      "Ê": 134,
      "Ë": 135,
      "Ì": 136,
      "Í": 137,
      "Î": 138,
      "Ï": 139,
      "Ð": 140,
      "Ñ": 141,
      "Ò": 142,
      "Ó": 143,
      "Ô": 144,
      "Õ": 145,
      "Ö": 146,
      "×": 147,
      "Ø": 148,
      "Ù": 149,
      "Ú": 150,
      "Û": 151,
      "Ü": 152,
      "Ý": 153,
      "Þ": 154,
      "ß": 155,
      "à": 156,
      "á": 157,
      "â": 158,
      "ã": 159,
      "ä": 160,
      "å": 161,
      "æ": 162,
      "ç": 163,
      "è": 164,
      "é": 165,
      "ê": 166,
      "ë": 167,
      "ì": 168,
      "í": 169,
      "î": 170,
      "ï": 171,
      "ð": 172,
      "ñ": 173,
      "ò": 174,
      "ó": 175,
      "ô": 176,
      "õ": 177,
      "ö": 178,
      "÷": 179,
      "ø": 180,
      "ù": 181,
      "ú": 182,
      "û": 183,
      "ü": 184,
      "ý": 185,
      "þ": 186,
      "ÿ": 187,
      "Ā": 188,
      "ā": 189,
      "Ă": 190,
      "ă": 191,
      "Ą": 192,
      "ą": 193,
      "Ć": 194,
      "ć": 195,
      "Ĉ": 196,
      "ĉ": 197,
      "Ċ": 198,
      "ċ": 199,
      "Č": 200,
      "č": 201,
      "Ď": 202,
      "ď": 203,
      "Đ": 204,
      "đ": 205,
      "Ē": 206,
      "ē": 207,
      "Ĕ": 208,
      "ĕ": 209,
      "Ė": 210,
      "ė": 211,
      "Ę": 212,
      "ę": 213,
      "Ě": 214,
      "ě": 215,
      "Ĝ": 216,
      "ĝ": 217,
      "Ğ": 218,
      "ğ": 219,
      "Ġ": 220,
      "ġ": 221,
      "Ģ": 222,
      "ģ": 223,
      "Ĥ": 224,
      "ĥ": 225,
      "Ħ": 226,
      "ħ": 227,
      "Ĩ": 228,
      "ĩ": 229,
      "Ī": 230,
      "ī": 231,
      "Ĭ": 232,
      "ĭ": 233,
      "Į": 234,
      "į": 235,
      "İ": 236,
      "ı": 237,
      "Ĳ": 238,
      "ĳ": 239,
      "Ĵ": 240,
      "ĵ": 241,
      "Ķ": 242,
      "ķ": 243,
      "ĸ": 244,
      "Ĺ": 245,
      "ĺ": 246,
      "Ļ": 247,
      "ļ": 248,
      "Ľ": 249,
      "ľ": 250,
      "Ŀ": 251,
      "ŀ": 252,
      "Ł": 253,
      "ł": 254,
      "Ń": 255,
      "Ġ-": 256,
      "Ġ=": 257,
      "if": 258,
      "Ġ+": 259,
      "Ġ<": 260,
      "Ġ>": 261,
      "EP": 262,
      "ST": 263,
      "STEP": 264,
      "?-": 265,
      "Ġ8": 266,
      "Ġ4": 267,
      "Ġ7": 268,
      "Ġ2": 269,
      "Ġ0": 270,
      "Ġ3": 271,
      "qd": 272,
      "kb": 273,
      "we": 274,
      "mc": 275,
      "ef": 276,
      "Ġ6": 277,
      "og": 278,
      ":$": 279,
      "Ġ9": 280,
      "Ġ1": 281,
      "Ġ5": 282,
      "Ġg": 283,
      "@^": 284,
      "@^$": 285,
      "Ġqd": 286,
      "Ġkb": 287,
      "Ġwe": 288,
      "Ġmc": 289,
      "Ġq": 290,
      "Ġef": 291,
      "Ġt": 292,
      "Ġh": 293,
      "Ġog": 294,
      "Ġp": 295,
      "Ġj": 296,
      "Ġz": 297,
      "Ġk": 298,
      "Ġf": 299,
      "Ġr": 300,
      "Ġm": 301,
      "Ġd": 302,
      "Ġo": 303,
      "Ġa": 304,
      "Ġw": 305,
      "Ġv": 306,
      "Ġy": 307,
      "Ġc": 308,
      "Ġn": 309,
      "Ġl": 310,
      "Ġe": 311,
      "Ġx": 312,
      "Ġi": 313,
      "Ġb": 314,
      "Ġs": 315,
      "Ġu": 316,
      "10": 317,
      "13": 318,
      "72": 319,
      "16": 320,
      "15": 321,
      "94": 322,
      "75": 323,
      "42": 324,
      "53": 325,
      "19": 326,
      "12": 327,
      "34": 328,
      "78": 329,
      "88": 330,
      "60": 331,
      "11": 332,
      "83": 333,
      "23": 334,
      "55": 335,
      "96": 336,
      "40": 337,
      "50": 338,
      "62": 339,
      "85": 340,
      "46": 341,
      "17": 342,
      "95": 343,
      "93": 344,
      "71": 345,
      "56": 346,
      "84": 347,
      "22": 348,
      "91": 349,
      "37": 350,
      "14": 351,
      "24": 352,
      "87": 353,
      "39": 354,
      "32": 355,
      "30": 356,
      "76": 357,
      "65": 358,
      "81": 359,
      "52": 360,
      "kq": 361,
      "58": 362,
      "41": 363,
      "92": 364,
      "70": 365,
      "90": 366,
      "21": 367,
      "mo": 368,
      "31": 369,
      "po": 370,
      "wr": 371,
      "Ġ10": 372,
      "ax": 373,
      "86": 374,
      "Ġ35": 375,
      "Ġ46": 376,
      "Ġ52": 377,
      "80": 378,
      "Ġ70": 379,
      "st": 380,
      "Ġ80": 381,
      "20": 382,
      "Ġ86": 383,
      "Ġ90": 384,
      "Ġ96": 385,
      "mb": 386,
      "gf": 387,
      "ye": 388,
      "Ġ33": 389,
      "Ġ44": 390,
      "Ġ57": 391,
      "Ġ64": 392,
      "Ġ63": 393,
      "Ġ65": 394,
      "Ġ87": 395,
      "om": 396,
      "Ġ94": 397,
      "gs": 398,
      "Ġ97": 399,
      "oi": 400,
      "Ġ12": 401,
      "qa": 402,
      "zr": 403,
      "Ġ25": 404,
      "Ġ23": 405,
      "Ġ43": 406,
      "td": 407,
      "br": 408,
      "pa": 409,
      "Ġ55": 410,
      "Ġ62": 411,
      "Ġ73": 412,
      "ut": 413,
      "Ġ67": 414,
      "cr": 415,
      "Ġ76": 416,
      "Ġ79": 417,
      "Ġ84": 418,
      "Ġ83": 419,
      "is": 420,
      "yk": 421,
      "ul": 422,
      "hw": 423,
      "rg": 424,
      "xk": 425,
      "jw": 426,
      "sq": 427,
      "nn": 428,
      "pp": 429,
      "ty": 430,
      "gw": 431,
      "sl": 432,
      "on": 433,
      "44": 434,
      "si": 435,
      "Ġ15": 436,
      "Ġ11": 437,
      "Ġ22": 438,
      "qm": 439,
      "Ġ42": 440,
      "pf": 441,
      "Ġ48": 442,
      "Ġ61": 443,
      "Ġ68": 444,
      "97": 445,
      "Ġ91": 446,
      "uy": 447,
      "nz": 448,
      "ma": 449,
      "mz": 450,
      "sv": 451,
      "oc": 452,
      "rq": 453,
      "ij": 454,
      "uq": 455,
      "69": 456,
      "ch": 457,
      "67": 458,
      "qg": 459,
      "hn": 460,
      "eu": 461,
      "xr": 462,
      "Ġ34": 463,
      "zk": 464,
      "jf": 465,
      "Ġ28": 466,
      "yr": 467,
      "Ġ71": 468,
      "Ġ41": 469,
      "Ġ78": 470,
      "Ġ81": 471,
      "hf": 472,
      "tc": 473,
      "jp": 474,
      "vd": 475,
      "nr": 476,
      "ge": 477,
      "tl": 478,
      "ck": 479,
      "mp": 480,
      "vl": 481,
      "au": 482,
      "pi": 483,
      "lb": 484,
      "ti": 485,
      "kn": 486,
      "57": 487,
      "oz": 488,
      "Ġkq": 489,
      "wd": 490,
      "ud": 491,
      "ug": 492,
      "sp": 493,
      "qv": 494,
      "sc": 495,
      "bx": 496,
      "sy": 497,
      "hj": 498,
      "rl": 499,
      "sg": 500,
      "mm": 501,
      "vy": 502,
      "ze": 503,
      "ui": 504,
      "qq": 505,
      "47": 506,
      "ae": 507,
      "45": 508,
      "pc": 509,
      "jj": 510,
      "tg": 511
    },
    "merges": [
      [
        "Ġ",
        "-"
      ],
      [
        "Ġ",
        "="
      ],
      [
        "i",
        "f"
      ],
      [
        "Ġ",
        "+"
      ],
      [
        "Ġ",
        "<"
      ],
      [
        "Ġ",
        ">"
      ],
      [
        "E",
        "P"
      ],
      [
        "S",
        "T"
      ],
      [
        "ST",
        "EP"
      ],
      [
        "?",
        "-"
      ],
      [
        "Ġ",
        "8"
      ],
      [
        "Ġ",
        "4"
      ],
      [
        "Ġ",
        "7"
      ],
      [
        "Ġ",
        "2"
      ],
      [
        "Ġ",
        "0"
      ],
      [
        "Ġ",
        "3"
      ],
      [
        "q",
        "d"
      ],
      [
        "k",
        "b"
      ],
      [
        "w",
        "e"
      ],
      [
        "m",
        "c"
      ],
      [
        "e",
        "f"
      ],
      [
        "Ġ",
        "6"
      ],
      [
        "o",
        "g"
      ],
      [
        ":",
        "$"
      ],
      [
        "Ġ",
        "9"
      ],
      [
        "Ġ",
        "1"
      ],
      [
        "Ġ",
        "5"
      ],
      [
        "Ġ",
        "g"
      ],
      [
        "@",
        "^"
      ],
      [
        "@^",
        "$"
      ],
      [
        "Ġ",
        "qd"
      ],
      [
        "Ġ",
        "kb"
      ],
      [
        "Ġ",
        "we"
      ],
      [
        "Ġ",
        "mc"
      ],
      [
        "Ġ",
        "q"
      ],
      [
        "Ġ",
        "ef"
      ],
      [
        "Ġ",
        "t"
      ],
      [
        "Ġ",
        "h"
      ],
      [
        "Ġ",
        "og"
      ],
      [
        "Ġ",
        "p"
      ],
      [
        "Ġ",
        "j"
      ],
      [
        "Ġ",
        "z"
      ],
      [
        "Ġ",
        "k"
      ],
      [
        "Ġ",
        "f"
      ],
      [
        "Ġ",
        "r"
      ],
      [
        "Ġ",
        "m"
      ],
      [
        "Ġ",
        "d"
      ],
      [
        "Ġ",
        "o"
      ],
      [
        "Ġ",
        "a"
      ],
      [
        "Ġ",
        "w"
      ],
      [
        "Ġ",
        "v"
      ],
      [
        "Ġ",
        "y"
      ],
      [
        "Ġ",
        "c"
      ],
      [
        "Ġ",
        "n"
      ],
      [
        "Ġ",
        "l"
      ],
      [
        "Ġ",
        "e"
      ],
      [
        "Ġ",
        "x"
      ],
      [
        "Ġ",
        "i"
      ],
      [
        "Ġ",
        "b"
      ],
      [
        "Ġ",
        "s"
      ],
      [
        "Ġ",
        "u"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "3"
      ],
      [
        "7",
        "2"
      ],
      [
        "1",
        "6"
      ],
      [
        "1",
        "5"
      ],
      [
        "9",
        "4"
      ],
      [
        "7",
        "5"
      ],
      [
        "4",
        "2"
      ],
      [
        "5",
        "3"
      ],
      [
        "1",
        "9"
      ],
      [
        "1",
        "2"
      ],
      [
        "3",
        "4"
      ],
      [
        "7",
        "8"
      ],
      [
        "8",
        "8"
      ],
      [
        "6",
        "0"
      ],
      [
        "1",
        "1"
      ],
      [
        "8",
        "3"
      ],
      [
        "2",
        "3"
      ],
      [
        "5",
        "5"
      ],
      [
        "9",
        "6"
      ],
      [
        "4",
        "0"
      ],
      [
        "5",
        "0"
      ],
      [
        "6",
        "2"
      ],
      [
        "8",
        "5"
      ],
      [
        "4",
        "6"
      ],
      [
        "1",
        "7"
      ],
      [
        "9",
        "5"
      ],
      [
        "9",
        "3"
      ],
      [
        "7",
        "1"
      ],
      [
        "5",
        "6"
      ],
      [
        "8",
        "4"
      ],
      [
        "2",
        "2"
      ],
      [
        "9",
        "1"
      ],
      [
        "3",
        "7"
      ],
      [
        "1",
        "4"
      ],
      [
        "2",
        "4"
      ],
      [
        "8",
        "7"
      ],
      [
        "3",
        "9"
      ],
      [
        "3",
        "2"
      ],
      [
        "3",
        "0"
      ],
      [
        "7",
        "6"
      ],
      [
        "6",
        "5"
      ],
      [
        "8",
        "1"
      ],
      [
        "5",
        "2"
      ],
      [
        "k",
        "q"
      ],
      [
        "5",
        "8"
      ],
      [
        "4",
        "1"
      ],
      [
        "9",
        "2"
      ],
      [
        "7",
        "0"
      ],
      [
        "9",
        "0"
      ],
      [
        "2",
        "1"
      ],
      [
        "m",
        "o"
      ],
      [
        "3",
        "1"
      ],
      [
        "p",
        "o"
      ],
      [
        "w",
        "r"
      ],
      [
        "Ġ1",
        "0"
      ],
      [
        "a",
        "x"
      ],
      [
        "8",
        "6"
      ],
      [
        "Ġ3",
        "5"
      ],
      [
        "Ġ4",
        "6"
      ],
      [
        "Ġ5",
        "2"
      ],
      [
        "8",
        "0"
      ],
      [
        "Ġ7",
        "0"
      ],
      [
        "s",
        "t"
      ],
      [
        "Ġ8",
        "0"
      ],
      [
        "2",
        "0"
      ],
      [
        "Ġ8",
        "6"
      ],
      [
        "Ġ9",
        "0"
      ],
      [
        "Ġ9",
        "6"
      ],
      [
        "m",
        "b"
      ],
      [
        "g",
        "f"
      ],
      [
        "y",
        "e"
      ],
      [
        "Ġ3",
        "3"
      ],
      [
        "Ġ4",
        "4"
      ],
      [
        "Ġ5",
        "7"
      ],
      [
        "Ġ6",
        "4"
      ],
      [
        "Ġ6",
        "3"
      ],
      [
        "Ġ6",
        "5"
      ],
      [
        "Ġ8",
        "7"
      ],
      [
        "o",
        "m"
      ],
      [
        "Ġ9",
        "4"
      ],
      [
        "g",
        "s"
      ],
      [
        "Ġ9",
        "7"
      ],
      [
        "o",
        "i"
      ],
      [
        "Ġ1",
        "2"
      ],
      [
        "q",
        "a"
      ],
      [
        "z",
        "r"
      ],
      [
        "Ġ2",
        "5"
      ],
      [
        "Ġ2",
        "3"
      ],
      [
        "Ġ4",
        "3"
      ],
      [
        "t",
        "d"
      ],
      [
        "b",
        "r"
      ],
      [
        "p",
        "a"
      ],
      [
        "Ġ5",
        "5"
      ],
      [
        "Ġ6",
        "2"
      ],
      [
        "Ġ7",
        "3"
      ],
      [
        "u",
        "t"
      ],
      [
        "Ġ6",
        "7"
      ],
      [
        "c",
        "r"
      ],
      [
        "Ġ7",
        "6"
      ],
      [
        "Ġ7",
        "9"
      ],
      [
        "Ġ8",
        "4"
      ],
      [
        "Ġ8",
        "3"
      ],
      [
        "i",
        "s"
      ],
      [
        "y",
        "k"
      ],
      [
        "u",
        "l"
      ],
      [
        "h",
        "w"
      ],
      [
        "r",
        "g"
      ],
      [
        "x",
        "k"
      ],
      [
        "j",
        "w"
      ],
      [
        "s",
        "q"
      ],
      [
        "n",
        "n"
      ],
      [
        "p",
        "p"
      ],
      [
        "t",
        "y"
      ],
      [
        "g",
        "w"
      ],
      [
        "s",
        "l"
      ],
      [
        "o",
        "n"
      ],
      [
        "4",
        "4"
      ],
      [
        "s",
        "i"
      ],
      [
        "Ġ1",
        "5"
      ],
      [
        "Ġ1",
        "1"
      ],
      [
        "Ġ2",
        "2"
      ],
      [
        "q",
        "m"
      ],
      [
        "Ġ4",
        "2"
      ],
      [
        "p",
        "f"
      ],
      [
        "Ġ4",
        "8"
      ],
      [
        "Ġ6",
        "1"
      ],
      [
        "Ġ6",
        "8"
      ],
      [
        "9",
        "7"
      ],
      [
        "Ġ9",
        "1"
      ],
      [
        "u",
        "y"
      ],
      [
        "n",
        "z"
      ],
      [
        "m",
        "a"
      ],
      [
        "m",
        "z"
      ],
      [
        "s",
        "v"
      ],
      [
        "o",
        "c"
      ],
      [
        "r",
        "q"
      ],
      [
        "i",
        "j"
      ],
      [
        "u",
        "q"
      ],
      [
        "6",
        "9"
      ],
      [
        "c",
        "h"
      ],
      [
        "6",
        "7"
      ],
      [
        "q",
        "g"
      ],
      [
        "h",
        "n"
      ],
      [
        "e",
        "u"
      ],
      [
        "x",
        "r"
      ],
      [
        "Ġ3",
        "4"
      ],
      [
        "z",
        "k"
      ],
      [
        "j",
        "f"
      ],
      [
        "Ġ2",
        "8"
      ],
      [
        "y",
        "r"
      ],
      [
        "Ġ7",
        "1"
      ],
      [
        "Ġ4",
        "1"
      ],
      [
        "Ġ7",
        "8"
      ],
      [
        "Ġ8",
        "1"
      ],
      [
        "h",
        "f"
      ],
      [
        "t",
        "c"
      ],
      [
        "j",
        "p"
      ],
      [
        "v",
        "d"
      ],
      [
        "n",
        "r"
      ],
      [
        "g",
        "e"
      ],
      [
        "t",
        "l"
      ],
      [
        "c",
        "k"
      ],
      [
        "m",
        "p"
      ],
      [
        "v",
        "l"
      ],
      [
        "a",
        "u"
      ],
      [
        "p",
        "i"
      ],
      [
        "l",
        "b"
      ],
      [
        "t",
        "i"
      ],
      [
        "k",
        "n"
      ],
      [
        "5",
        "7"
      ],
      [
        "o",
        "z"
      ],
      [
        "Ġk",
        "q"
      ],
      [
        "w",
        "d"
      ],
      [
        "u",
        "d"
      ],
      [
        "u",
        "g"
      ],
      [
        "s",
        "p"
      ],
      [
        "q",
        "v"
      ],
      [
        "s",
        "c"
      ],
      [
        "b",
        "x"
      ],
      [
        "s",
        "y"
      ],
      [
        "h",
        "j"
      ],
      [
        "r",
        "l"
      ],
      [
        "s",
        "g"
      ],
      [
        "m",
        "m"
      ],
      [
        "v",
        "y"
      ],
      [
        "z",
        "e"
      ],
      [
        "u",
        "i"
      ],
      [
        "q",
        "q"
      ],
      [
        "4",
        "7"
      ],
      [
        "a",
        "e"
      ],
      [
        "4",
        "5"
      ],
      [
        "p",
        "c"
      ],
      [
        "j",
        "j"
      ],
      [
        "t",
        "g"
      ]
    ]
  }
}